# Summer Analytics 2020 - Basic Data Analysis

- ####  Welcome to your first assignment, on basic data analysis!
- #### This Assignment is ungraded



### 1) Import Pandas

In [2]:
import pandas as pd

### 2) Import the dataset and  Assign it to a variable called users and use the 'user_id' as index

#### Import the dataset from this url (https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [3]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv('userdata.csv',sep='|',index_col='user_id')

### 3) Display the first 25 entries

In [6]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### 4) Display the last 10 entries

In [64]:
print(users.tail(10))

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### 5) What is the number of observations in the dataset?

In [7]:
# Number of entries
print(len(users))

943

### 6) What is the number of columns in the dataset, also print the name of all the columns?

In [8]:
"""
    users.shape[0]  for rows
    users.shape[1] for columns
"""
# Number of Columns
print(len(users.columns))

# All columns
print(users.columns)

4
Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### 7) What is the data type of each column?

In [69]:
# Datatype of each column
print(users.dtypes)

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 8) Print only the occupation column

In [10]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### 9) How many different occupations are in this dataset?

In [15]:
print(users.occupation.nunique())
print(users.occupation.unique())

21
['technician' 'other' 'writer' 'executive' 'administrator' 'student'
 'lawyer' 'educator' 'scientist' 'entertainment' 'programmer' 'librarian'
 'homemaker' 'artist' 'engineer' 'marketing' 'none' 'healthcare' 'retired'
 'salesman' 'doctor']

### 10) What is the most frequent occupation?

In [25]:
print(users.occupation.value_counts().head().index[0])

print(users.occupation.mode())

student
0    student
dtype: object

### 11) Summarize the DataFrame.

In [18]:
print(users.describe())

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### 12) Summarize only the occupation column

In [85]:
print(users.occupation.describe())

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### 13) What is the mean age of users?

In [26]:
mean_age = users['age'].mean()
users.age.mean()
print(mean_age)

34.05196182396607

### 14) What is the age with least occurrence?

In [125]:
occurence = users['age'].value_counts()
age_with_least_count = occurence.index[-1] 
print(age_with_least_count)

7